nesl/crest/sketches/stm32/tinyodom_tcn_stm32_lrun/Appli/Src/tcn_dut_runner.c
#include "tcn_dut_runner.h"

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "main.h"
#include "network.h"
#include "network_data.h"
#include "stm32n6xx_hal_rtc.h"
#include "stm32n6xx_hal_rtc_ex.h"
#include "stm32n6xx_nucleo_xspi.h"
#include "tcn_dut_phase_config.h"

/*
 * This module owns the DUT-side HIL protocol for the TinyODOM-Ex LRUN app.
 * It performs three jobs:
 *   - bootstraps the generated ST Edge AI network and optional external weights
 *   - speaks the host-visible START/READY/result text protocol over debug COM
 *   - runs either back-to-back or cadenced measurement loops and emits timing
 *     telemetry in a parseable format for the HIL harness
 */

AI_ALIGNED(4)
static ai_u8 s_network_activations[AI_NETWORK_DATA_ACTIVATIONS_SIZE];

enum
{
  kStartCommandTimeoutMs = 30000,
  kStartReadyHeartbeatMs = 5000,
  kUartPollTimeoutMs = 20,
  kArmHoldMs = 600,
  kRtcTimebaseHz = 32768,
  kRtcSyncPrediv = kRtcTimebaseHz - 1,
  kWakeupDivider = 16,
};

static const uintptr_t kExternalWeightsStart = 0x70000000UL;
static const uintptr_t kExternalWeightsEnd = 0x80000000UL;

#define TCN_DUT_TRIGGER_GPIO_PORT   GPIOD
#define TCN_DUT_TRIGGER_GPIO_PIN    GPIO_PIN_0
#define TCN_DUT_ARM_GPIO_PORT       GPIOE
#define TCN_DUT_ARM_GPIO_PIN        GPIO_PIN_9

#define TCN_DUT_STOP_MODE_VARIANT "system_stop_mainreg_wfi"

typedef struct
{
  uint64_t timer_per_inference_scaled_1e6;
  uint64_t timer_per_window_scaled_1e6;
  uint64_t dwt_cycles_per_inference_milli;
  uint64_t rtc_sleep_total_us;
  int64_t wake_recovery_total_us;
  int64_t wake_overshoot_total_us;
  uint32_t clock_hz;
  uint32_t deadline_miss_count;
  uint32_t runs_completed;
  bool have_timing;
  bool have_cycles;
} TcnDutMeasurement;

static RTC_HandleTypeDef s_rtc_handle;
static volatile bool s_rtc_wakeup_fired = false;
static const char *s_rtc_clock_source = "UNINITIALIZED";
static uint32_t s_rtc_clock_hz_nominal = 0U;
static const char *s_cadence_timing_quality = "unknown";
static bool s_external_weight_mapping_initialized = false;

void SystemClock_Config(void);

/* Convert a requested stop-sleep interval into the RTC wakeup counter domain. */
static uint32_t wakeup_counter_for_sleep_us(uint32_t sleep_us)
{
  uint64_t rtc_clock_hz = (uint64_t)s_rtc_clock_hz_nominal;
  uint64_t counter = 0ULL;

  if (rtc_clock_hz == 0ULL)
  {
    return 0U;
  }

  counter = ((uint64_t)sleep_us * rtc_clock_hz) / ((uint64_t)kWakeupDivider * 1000000ULL);
  if (counter > 0xFFFFU)
  {
    counter = 0xFFFFU;
  }

  return (uint32_t)counter;
}

/* All host-facing protocol output is line-oriented and flushed immediately. */
static void flush_stdout(void)
{
  fflush(stdout);
}

static void emit_line(const char *line)
{
  printf("%s\r\n", line);
  flush_stdout();
}

/* Emit the HIL harness telemetry fields in the exact textual format it parses. */
static void emit_float_scaled_line(const char *label, uint64_t scaled_1e6, bool valid)
{
  if (!valid)
  {
    printf("%s: -1\r\n", label);
    flush_stdout();
    return;
  }

  printf("%s: %lu.%06lu\r\n",
         label,
         (unsigned long)(scaled_1e6 / 1000000ULL),
         (unsigned long)(scaled_1e6 % 1000000ULL));
  flush_stdout();
}

static void emit_signed_us_line(const char *label, int64_t value_us, bool valid)
{
  if (!valid)
  {
    printf("%s: -1\r\n", label);
    flush_stdout();
    return;
  }

  printf("%s: %ld\r\n", label, (long)value_us);
  flush_stdout();
}

static void emit_cpu_clock_telemetry(uint32_t cpu_clock_hz)
{
  printf("clock hz output: %lu\r\n", (unsigned long)cpu_clock_hz);
  flush_stdout();
}

static void emit_cycle_telemetry(uint64_t cycles_per_inference_milli, bool valid)
{
  if (!valid)
  {
    emit_line("dwt cycles per inference output: -1");
    return;
  }

  printf("dwt cycles per inference output: %lu.%03lu\r\n",
         (unsigned long)(cycles_per_inference_milli / 1000ULL),
         (unsigned long)(cycles_per_inference_milli % 1000ULL));
  flush_stdout();
}

static uintptr_t generated_weights_address(void)
{
  return (uintptr_t)ai_network_data_weights_get();
}

static bool weights_use_external_flash(void)
{
  uintptr_t weights_addr = generated_weights_address();
  return (weights_addr >= kExternalWeightsStart) && (weights_addr < kExternalWeightsEnd);
}

/* Bring up XSPI2 only when ST Edge AI placed weights in the external-flash map. */
static bool configure_external_weight_xspi2_clocking(void)
{
  RCC_PeriphCLKInitTypeDef periph_clk_init = {0};

  __HAL_RCC_PWR_CLK_ENABLE();
  HAL_PWREx_EnableVddIO3();
  HAL_PWREx_ConfigVddIORange(PWR_VDDIO3, PWR_VDDIO_RANGE_1V8);

  periph_clk_init.PeriphClockSelection = RCC_PERIPHCLK_XSPI2;
  periph_clk_init.Xspi2ClockSelection = RCC_XSPI2CLKSOURCE_IC3;
  periph_clk_init.ICSelection[RCC_IC3].ClockSelection = RCC_ICCLKSOURCE_PLL1;
  periph_clk_init.ICSelection[RCC_IC3].ClockDivider = 24;

  if (HAL_RCCEx_PeriphCLKConfig(&periph_clk_init) != HAL_OK)
  {
    return false;
  }

  __HAL_RCC_XSPIM_CLK_ENABLE();
  return true;
}

/*
 * The generated network exposes a weights pointer but does not guarantee that
 * the NOR memory-mapped view is already active. Probe and enable that mapping
 * once before the first inference when external weights are in use.
 */
static bool ensure_external_weight_mapping_ready(void)
{
  BSP_XSPI_NOR_Init_t xspi_init = {0};
  uintptr_t weights_addr = generated_weights_address();
  volatile const uint32_t *probe_word = (const uint32_t *)weights_addr;
  uint32_t first_word = 0U;
  int32_t status = BSP_ERROR_NONE;

  if (!weights_use_external_flash())
  {
    return true;
  }

  if (s_external_weight_mapping_initialized)
  {
    return true;
  }

  xspi_init.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
  xspi_init.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;

  if (!configure_external_weight_xspi2_clocking())
  {
    printf("STM32_XSPI_INIT=FAIL stage=clock_config status=%d addr=0x%08lx\r\n",
           HAL_ERROR,
           (unsigned long)weights_addr);
    flush_stdout();
    return false;
  }

  status = BSP_XSPI_NOR_Init(0U, &xspi_init);
  if (status != BSP_ERROR_NONE)
  {
    printf("STM32_XSPI_INIT=FAIL stage=init status=%ld addr=0x%08lx\r\n",
           (long)status,
           (unsigned long)weights_addr);
    flush_stdout();
    return false;
  }

  status = BSP_XSPI_NOR_EnableMemoryMappedMode(0U);
  if (status != BSP_ERROR_NONE)
  {
    printf("STM32_XSPI_INIT=FAIL stage=memory_mapped status=%ld addr=0x%08lx\r\n",
           (long)status,
           (unsigned long)weights_addr);
    flush_stdout();
    return false;
  }

  __DSB();
  __ISB();
  first_word = *probe_word;
  printf("STM32_XSPI_INIT=OK addr=0x%08lx word0=0x%08lx\r\n",
         (unsigned long)weights_addr,
         (unsigned long)first_word);
  flush_stdout();
  s_external_weight_mapping_initialized = true;
  return true;
}

