nesl/crest/sketches/stm32/tinyodom_tcn_stm32_lrun/Appli/Src/tcn_dut_runner.c
static bool restore_external_weight_clocking_after_stop(void)
{
  if (!weights_use_external_flash())
  {
    return true;
  }

  return configure_external_weight_xspi2_clocking();
}

static void set_harness_idle(void)
{
  HAL_GPIO_WritePin(TCN_DUT_TRIGGER_GPIO_PORT, TCN_DUT_TRIGGER_GPIO_PIN, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(TCN_DUT_ARM_GPIO_PORT, TCN_DUT_ARM_GPIO_PIN, GPIO_PIN_SET);
}

static void arm_harness_window(void)
{
  HAL_GPIO_WritePin(TCN_DUT_ARM_GPIO_PORT, TCN_DUT_ARM_GPIO_PIN, GPIO_PIN_RESET);
  HAL_Delay(kArmHoldMs);
  HAL_GPIO_WritePin(TCN_DUT_TRIGGER_GPIO_PORT, TCN_DUT_TRIGGER_GPIO_PIN, GPIO_PIN_SET);
}

static void disarm_harness_window(void)
{
  HAL_GPIO_WritePin(TCN_DUT_TRIGGER_GPIO_PORT, TCN_DUT_TRIGGER_GPIO_PIN, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(TCN_DUT_ARM_GPIO_PORT, TCN_DUT_ARM_GPIO_PIN, GPIO_PIN_SET);
}

static uint32_t read_cpu_clock_hz(void)
{
  SystemCoreClockUpdate();
  if (SystemCoreClock > 0U)
  {
    return SystemCoreClock;
  }
  return HAL_RCC_GetCpuClockFreq();
}

static bool uart_read_line(char *buffer, size_t buffer_size, uint32_t total_timeout_ms)
{
  uint32_t start_tick = HAL_GetTick();
  size_t used = 0;

  if (buffer_size == 0U)
  {
    return false;
  }
  buffer[0] = '\0';

  while ((HAL_GetTick() - start_tick) < total_timeout_ms)
  {
    uint8_t ch = 0;
    if (HAL_UART_Receive(&hcom_uart[COM1], &ch, 1, kUartPollTimeoutMs) != HAL_OK)
    {
      continue;
    }

    if ((ch == '\r') || (ch == '\n'))
    {
      if (used == 0U)
      {
        continue;
      }
      buffer[used] = '\0';
      return true;
    }

    if (used + 1U < buffer_size)
    {
      buffer[used++] = (char)ch;
      buffer[used] = '\0';
    }
  }

  return false;
}

static bool wait_for_start_command(void)
{
  uint32_t wait_started = HAL_GetTick();
  uint32_t last_ready_emit = 0U;
  char line[32];

  while ((HAL_GetTick() - wait_started) < kStartCommandTimeoutMs)
  {
    uint32_t now = HAL_GetTick();
    if ((last_ready_emit == 0U) || ((now - last_ready_emit) >= kStartReadyHeartbeatMs))
    {
      emit_line("DUT READY");
      last_ready_emit = now;
    }

    if (!uart_read_line(line, sizeof(line), kStartReadyHeartbeatMs))
    {
      continue;
    }

    if (strcmp(line, "START") == 0)
    {
      return true;
    }
  }

  return false;
}

static void fill_input_buffer(ai_buffer *input)
{
  memset((void *)input[0].data, 0, AI_NETWORK_IN_1_SIZE_BYTES);
}

static bool rtc_try_init_with_source(uint32_t oscillator_type,
                                     uint32_t rtc_clock_selection,
                                     const char *label,
                                     uint32_t nominal_hz)
{
  RCC_OscInitTypeDef osc_init = {0};
  RCC_PeriphCLKInitTypeDef periph_clk_init = {0};
  RTC_TimeTypeDef rtc_time = {0};
  RTC_DateTypeDef rtc_date = {0};
  RTC_PrivilegeStateTypeDef privilege_state = {0};
  RTC_SecureStateTypeDef secure_state = {0};
  HAL_StatusTypeDef status = HAL_OK;

  __HAL_RCC_PWR_CLK_ENABLE();
  HAL_PWR_EnableBkUpAccess();
  printf("STM32_RTC_STAGE=backup_access source=%s\r\n", label);
  flush_stdout();

  osc_init.OscillatorType = oscillator_type;
  osc_init.PLL1.PLLState = RCC_PLL_NONE;
  osc_init.PLL2.PLLState = RCC_PLL_NONE;
  osc_init.PLL3.PLLState = RCC_PLL_NONE;
  osc_init.PLL4.PLLState = RCC_PLL_NONE;
  if (oscillator_type == RCC_OSCILLATORTYPE_LSE)
  {
    osc_init.LSEState = RCC_LSE_ON;
  }
  else
  {
    osc_init.LSIState = RCC_LSI_ON;
  }

  emit_line("STM32_RTC_STAGE=osc_config_start");
  status = HAL_RCC_OscConfig(&osc_init);
  if (status != HAL_OK)
  {
    printf("STM32_RTC_STAGE=osc_config_fail status=%d source=%s\r\n", (int)status, label);
    flush_stdout();
    return false;
  }
  emit_line("STM32_RTC_STAGE=osc_config_ok");

  periph_clk_init.PeriphClockSelection = RCC_PERIPHCLK_RTC;
  periph_clk_init.RTCClockSelection = rtc_clock_selection;
  emit_line("STM32_RTC_STAGE=periph_clk_start");
  status = HAL_RCCEx_PeriphCLKConfig(&periph_clk_init);
  if (status != HAL_OK)
  {
    printf("STM32_RTC_STAGE=periph_clk_fail status=%d source=%s\r\n", (int)status, label);
    flush_stdout();
    return false;
  }
  emit_line("STM32_RTC_STAGE=periph_clk_ok");

  emit_line("STM32_RTC_STAGE=rtc_clock_enable_start");
  __HAL_RCC_RTC_ENABLE();
  emit_line("STM32_RTC_STAGE=rtc_clock_enable_ok");

  emit_line("STM32_RTC_STAGE=rtc_handle_setup_start");
  s_rtc_handle.Instance = RTC;
  s_rtc_handle.Init.HourFormat = RTC_HOURFORMAT_24;
  s_rtc_handle.Init.AsynchPrediv = 0U;
  /* Keep the RTC calendar and wake-up timer on the same 32.768 kHz basis so
   * subsecond timestamps and WUT sleep requests use one consistent timebase. */
  s_rtc_handle.Init.SynchPrediv = kRtcSyncPrediv;
  s_rtc_handle.Init.OutPut = RTC_OUTPUT_DISABLE;
  s_rtc_handle.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
  s_rtc_handle.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
  emit_line("STM32_RTC_STAGE=rtc_handle_setup_ok");

  emit_line("STM32_RTC_STAGE=rtc_init_start");
  status = HAL_RTC_Init(&s_rtc_handle);
  if (status != HAL_OK)
  {
    printf("STM32_RTC_STAGE=rtc_init_fail status=%d source=%s\r\n", (int)status, label);
    flush_stdout();
    return false;
  }
  emit_line("STM32_RTC_STAGE=rtc_init_ok");

  privilege_state.rtcPrivilegeFull = RTC_PRIVILEGE_FULL_NO;
  privilege_state.backupRegisterPrivZone = RTC_PRIVILEGE_BKUP_ZONE_NONE;
  privilege_state.backupRegisterStartZone2 = RTC_BKP_DR0;
  privilege_state.backupRegisterStartZone3 = RTC_BKP_DR0;
  emit_line("STM32_RTC_STAGE=privilege_start");
  status = HAL_RTCEx_PrivilegeModeSet(&s_rtc_handle, &privilege_state);
  if (status != HAL_OK)
  {
    printf("STM32_RTC_STAGE=privilege_fail status=%d source=%s\r\n", (int)status, label);
    flush_stdout();
    return false;
  }
  emit_line("STM32_RTC_STAGE=privilege_ok");

  secure_state.rtcSecureFull = RTC_SECURE_FULL_YES;
  secure_state.backupRegisterStartZone2 = RTC_BKP_DR0;
  secure_state.backupRegisterStartZone3 = RTC_BKP_DR0;
  emit_line("STM32_RTC_STAGE=secure_start");
  status = HAL_RTCEx_SecureModeSet(&s_rtc_handle, &secure_state);
  if (status != HAL_OK)
  {
    printf("STM32_RTC_STAGE=secure_fail status=%d source=%s\r\n", (int)status, label);
    flush_stdout();
    return false;
  }
  emit_line("STM32_RTC_STAGE=secure_ok");

