nesl/crest/sketches/stm32/tinyodom_tcn_stm32_lrun/Appli/Src/tcn_dut_runner.c
  rtc_time.Hours = 0U;
  rtc_time.Minutes = 0U;
  rtc_time.Seconds = 0U;
  rtc_time.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
  rtc_time.StoreOperation = RTC_STOREOPERATION_RESET;
  emit_line("STM32_RTC_STAGE=set_time_start");
  status = HAL_RTC_SetTime(&s_rtc_handle, &rtc_time, RTC_FORMAT_BIN);
  if (status != HAL_OK)
  {
    printf("STM32_RTC_STAGE=set_time_fail status=%d source=%s\r\n", (int)status, label);
    flush_stdout();
    return false;
  }
  emit_line("STM32_RTC_STAGE=set_time_ok");

  rtc_date.WeekDay = RTC_WEEKDAY_MONDAY;
  rtc_date.Month = RTC_MONTH_JANUARY;
  rtc_date.Date = 1U;
  rtc_date.Year = 24U;
  emit_line("STM32_RTC_STAGE=set_date_start");
  status = HAL_RTC_SetDate(&s_rtc_handle, &rtc_date, RTC_FORMAT_BIN);
  if (status != HAL_OK)
  {
    printf("STM32_RTC_STAGE=set_date_fail status=%d source=%s\r\n", (int)status, label);
    flush_stdout();
    return false;
  }
  emit_line("STM32_RTC_STAGE=set_date_ok");

  s_rtc_clock_source = label;
  s_rtc_clock_hz_nominal = nominal_hz;
  s_cadence_timing_quality = (strcmp(label, "LSE") == 0) ? "crystal" : "rc_coarse";
  HAL_RCCEx_WakeUpStopCLKConfig(RCC_STOP_WAKEUPCLOCK_HSI);
  return true;
}

static bool rtc_init(void)
{
  /* Cadenced timing is validated against real wall-clock cadence, so use the
   * board's 32.768 kHz crystal-backed RTC source rather than the coarse LSI RC
   * oscillator. Fail the run if LSE bring-up does not succeed. */
  return rtc_try_init_with_source(RCC_OSCILLATORTYPE_LSE, RCC_RTCCLKSOURCE_LSE, "LSE", kRtcTimebaseHz);
}

static uint64_t rtc_time_to_us(const RTC_TimeTypeDef *time)
{
  uint32_t seconds_of_day = ((uint32_t)time->Hours * 3600U) +
                            ((uint32_t)time->Minutes * 60U) +
                            (uint32_t)time->Seconds;
  uint32_t fraction_ticks = 0U;
  uint64_t rtc_clock_hz = (uint64_t)s_rtc_clock_hz_nominal;

  if (time->SecondFraction >= time->SubSeconds)
  {
    fraction_ticks = time->SecondFraction - time->SubSeconds;
  }

  if (rtc_clock_hz == 0ULL)
  {
    rtc_clock_hz = (uint64_t)kRtcTimebaseHz;
  }

  return ((uint64_t)seconds_of_day * 1000000ULL) +
         (((uint64_t)fraction_ticks * 1000000ULL) / rtc_clock_hz);
}

static uint64_t rtc_datetime_to_us(const RTC_TimeTypeDef *time, const RTC_DateTypeDef *date)
{
  uint64_t day_offset_seconds = 0ULL;

  /* The cadence windows in this DUT are only a few seconds long, so using the
   * day-of-month as the coarse day offset is sufficient to keep timestamps
   * monotonic across second and midnight rollovers without implementing full
   * calendar conversion logic. */
  if (date->Date > 0U)
  {
    day_offset_seconds = ((uint64_t)date->Date - 1ULL) * 86400ULL;
  }

  return (day_offset_seconds * 1000000ULL) + rtc_time_to_us(time);
}

static uint64_t rtc_now_us(void)
{
  RTC_TimeTypeDef first_time = {0};
  RTC_TimeTypeDef second_time = {0};
  RTC_DateTypeDef first_date = {0};
  RTC_DateTypeDef second_date = {0};
  uint64_t first_us = 0ULL;
  uint64_t second_us = 0ULL;
  int attempt = 0;

  /* Read RTC time/date twice and keep the second sample only when it is
   * monotonic relative to the first. This avoids mixing a pre-rollover time
   * sample with a post-rollover date sample when the cadence window crosses a
   * second boundary. */
  for (attempt = 0; attempt < 4; ++attempt)
  {
    HAL_RTC_GetTime(&s_rtc_handle, &first_time, RTC_FORMAT_BIN);
    HAL_RTC_GetDate(&s_rtc_handle, &first_date, RTC_FORMAT_BIN);
    HAL_RTC_GetTime(&s_rtc_handle, &second_time, RTC_FORMAT_BIN);
    HAL_RTC_GetDate(&s_rtc_handle, &second_date, RTC_FORMAT_BIN);

    first_us = rtc_datetime_to_us(&first_time, &first_date);
    second_us = rtc_datetime_to_us(&second_time, &second_date);
    if (second_us >= first_us)
    {
      return second_us;
    }
  }

  return second_us;
}

static bool restore_runtime_clocks(void)
{
  RCC_PeriphCLKInitTypeDef periph_clk_init = {0};

  SystemClock_Config();

  periph_clk_init.PeriphClockSelection = RCC_PERIPHCLK_USART1;
  periph_clk_init.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  if (HAL_RCCEx_PeriphCLKConfig(&periph_clk_init) != HAL_OK)
  {
    return false;
  }

  if (weights_use_external_flash())
  {
    if (!restore_external_weight_clocking_after_stop())
    {
      return false;
    }
  }

  SystemCoreClockUpdate();
  return true;
}

static bool stop_sleep_for_us(uint32_t sleep_us, int64_t *wake_recovery_us)
{
  uint32_t wakeup_counter = 0U;
  uint64_t after_wake_us = 0ULL;
  uint64_t after_restore_us = 0ULL;

  if (sleep_us < TCN_DUT_MIN_SLEEP_US)
  {
    return false;
  }

  wakeup_counter = wakeup_counter_for_sleep_us(sleep_us);
  if (wakeup_counter < 2U)
  {
    return false;
  }
  wakeup_counter -= 1U;
  printf("STM32_CADENCE_SLEEP=enter us=%lu wut=%lu\r\n",
         (unsigned long)sleep_us,
         (unsigned long)wakeup_counter);
  flush_stdout();

  s_rtc_wakeup_fired = false;
  HAL_NVIC_DisableIRQ(RTC_S_IRQn);
  NVIC_ClearPendingIRQ(RTC_S_IRQn);
  HAL_NVIC_SetPriority(RTC_S_IRQn, 0U, 0U);
  HAL_NVIC_EnableIRQ(RTC_S_IRQn);
  HAL_RTCEx_DeactivateWakeUpTimer(&s_rtc_handle);
  if (HAL_RTCEx_SetWakeUpTimer_IT(&s_rtc_handle,
                                  wakeup_counter,
                                  RTC_WAKEUPCLOCK_RTCCLK_DIV16,
                                  0U) != HAL_OK)
  {
    return false;
  }

  HAL_SuspendTick();
  HAL_PWR_EnterSTOPMode(PWR_MAINREGULATOR_ON, PWR_STOPENTRY_WFI);
  after_wake_us = rtc_now_us();
  if (__HAL_PWR_GET_FLAG(PWR_FLAG_STOPF) != RESET)
  {
    __HAL_PWR_CLEAR_FLAG(PWR_FLAG_STOPF);
  }

  if (!restore_runtime_clocks())
  {
    HAL_ResumeTick();
    return false;
  }

  after_restore_us = rtc_now_us();
  HAL_ResumeTick();
  HAL_RTCEx_DeactivateWakeUpTimer(&s_rtc_handle);
  HAL_NVIC_DisableIRQ(RTC_S_IRQn);

  if (wake_recovery_us != NULL)
  {
    *wake_recovery_us = (int64_t)(after_restore_us - after_wake_us);
  }
  printf("STM32_CADENCE_SLEEP=woke fired=%d recovery_us=%ld\r\n",
         s_rtc_wakeup_fired ? 1 : 0,
         (long)((wake_recovery_us != NULL) ? *wake_recovery_us : -1L));
  flush_stdout();
  return s_rtc_wakeup_fired;
}

static bool rtc_wakeup_irq_self_test(void)
{
  const uint32_t self_test_counter = 100U;
  const uint64_t timeout_us = 250000ULL;
  uint64_t deadline_us = rtc_now_us() + timeout_us;

