nesl/crest/sketches/stm32/tinyodom_tcn_stm32_lrun/Appli/Src/tcn_dut_runner.c
  s_rtc_wakeup_fired = false;
  HAL_NVIC_DisableIRQ(RTC_S_IRQn);
  NVIC_ClearPendingIRQ(RTC_S_IRQn);
  HAL_NVIC_SetPriority(RTC_S_IRQn, 0U, 0U);
  HAL_NVIC_EnableIRQ(RTC_S_IRQn);
  HAL_RTCEx_DeactivateWakeUpTimer(&s_rtc_handle);
  if (HAL_RTCEx_SetWakeUpTimer_IT(&s_rtc_handle,
                                  self_test_counter,
                                  RTC_WAKEUPCLOCK_RTCCLK_DIV16,
                                  0U) != HAL_OK)
  {
    emit_line("STM32_RTC_WUT_SELFTEST=ARM_FAIL");
    return false;
  }

  while ((!s_rtc_wakeup_fired) && (rtc_now_us() < deadline_us))
  {
  }

  HAL_RTCEx_DeactivateWakeUpTimer(&s_rtc_handle);
  HAL_NVIC_DisableIRQ(RTC_S_IRQn);

  printf("STM32_RTC_WUT_SELFTEST=%s fired=%d smISR=0x%08lx misr=0x%08lx sr=0x%08lx seccfgr=0x%08lx privcfgr=0x%08lx\r\n",
         s_rtc_wakeup_fired ? "OK" : "FAIL",
         s_rtc_wakeup_fired ? 1 : 0,
         (unsigned long)RTC->SMISR,
         (unsigned long)RTC->MISR,
         (unsigned long)RTC->SR,
         (unsigned long)RTC->SECCFGR,
         (unsigned long)RTC->PRIVCFGR);
  flush_stdout();
  return s_rtc_wakeup_fired;
}

static void emit_phase_header(void)
{
  const char *phase_label =
      (TCN_DUT_SELECTED_PHASE == TCN_DUT_PHASE_CADENCED) ? "cadenced" : "back_to_back";

  printf("phase output: %s\r\n", phase_label);
  printf("rtc clock source output: %s\r\n", s_rtc_clock_source);
  printf("rtc clock hz nominal output: %lu\r\n", (unsigned long)s_rtc_clock_hz_nominal);
  printf("cadence timing quality output: %s\r\n", s_cadence_timing_quality);
  printf("stop mode variant output: %s\r\n", TCN_DUT_STOP_MODE_VARIANT);
  printf("cadence budget (ms): %d\r\n", TCN_DUT_LATENCY_BUDGET_MS);
  flush_stdout();
}

static void emit_measurement_telemetry(const TcnDutMeasurement *measurement)
{
  bool have_means = (measurement->runs_completed > 0U) && measurement->have_timing;
  bool cadenced_phase = (TCN_DUT_SELECTED_PHASE == TCN_DUT_PHASE_CADENCED);
  int64_t wake_recovery_mean_us = -1;
  int64_t wake_overshoot_mean_us = -1;

  if (measurement->runs_completed > 0U)
  {
    printf("runs: %lu\r\n", (unsigned long)measurement->runs_completed);
  }
  else
  {
    emit_line("runs: 0");
  }

  emit_cpu_clock_telemetry(measurement->clock_hz);
  emit_cycle_telemetry(measurement->dwt_cycles_per_inference_milli, measurement->have_cycles);
  emit_float_scaled_line("timer per inference output",
                         measurement->timer_per_inference_scaled_1e6,
                         have_means);
  emit_float_scaled_line("timer per window output",
                         measurement->timer_per_window_scaled_1e6,
                         measurement->have_timing);
  if (TCN_DUT_SELECTED_PHASE == TCN_DUT_PHASE_BACK_TO_BACK)
  {
    emit_float_scaled_line("timer output",
                           measurement->timer_per_inference_scaled_1e6,
                           have_means);
  }

  if (measurement->runs_completed > 0U)
  {
    wake_overshoot_mean_us = measurement->wake_overshoot_total_us / (int64_t)measurement->runs_completed;
  }
  if (cadenced_phase && (measurement->runs_completed > 0U))
  {
    wake_recovery_mean_us = measurement->wake_recovery_total_us / (int64_t)measurement->runs_completed;
  }

  if (cadenced_phase)
  {
    emit_signed_us_line("wake recovery us",
                        wake_recovery_mean_us,
                        measurement->runs_completed > 0U);
    emit_signed_us_line("wake overshoot us",
                        wake_overshoot_mean_us,
                        measurement->runs_completed > 0U);
    printf("rtc sleep total ms: %lu.%03lu\r\n",
           (unsigned long)(measurement->rtc_sleep_total_us / 1000ULL),
           (unsigned long)(measurement->rtc_sleep_total_us % 1000ULL));
    printf("cadence deadline misses: %lu\r\n", (unsigned long)measurement->deadline_miss_count);
  }
  emit_line("inference seq output: 1");

  printf("STM32_AI_RUN=OK\r\n");
  if (measurement->have_cycles)
  {
    printf("STM32_AI_LATENCY_CYCLES=%lu\r\n",
           (unsigned long)(measurement->dwt_cycles_per_inference_milli / 1000ULL));
  }
  else
  {
    emit_line("STM32_AI_LATENCY_CYCLES=0");
  }
  flush_stdout();
}

static bool run_back_to_back_window(ai_handle network,
                                    ai_buffer *input,
                                    ai_buffer *output,
                                    TcnDutMeasurement *measurement)
{
  uint32_t start_cycles = 0U;
  uint32_t elapsed_cycles = 0U;
  ai_i32 batch = 0;

  fill_input_buffer(input);
  arm_harness_window();
  start_cycles = DWT->CYCCNT;

  for (int run_idx = 0; run_idx < TCN_DUT_MEASURED_RUNS; ++run_idx)
  {
    batch = ai_network_run(network, input, output);
    if (batch != 1)
    {
      disarm_harness_window();
      printf("STM32_AI_RUN=FAIL batch=%ld run=%d\r\n", (long)batch, run_idx + 1);
      flush_stdout();
      return false;
    }
    measurement->runs_completed++;
  }

  elapsed_cycles = DWT->CYCCNT - start_cycles;
  disarm_harness_window();

  measurement->clock_hz = read_cpu_clock_hz();
  measurement->have_cycles = measurement->runs_completed > 0U;
  measurement->have_timing = measurement->runs_completed > 0U;
  if (measurement->runs_completed > 0U)
  {
    measurement->dwt_cycles_per_inference_milli =
        ((uint64_t)elapsed_cycles * 1000ULL) / (uint64_t)measurement->runs_completed;
    measurement->timer_per_inference_scaled_1e6 =
        ((uint64_t)elapsed_cycles * 1000000ULL) /
        ((uint64_t)measurement->clock_hz * (uint64_t)measurement->runs_completed);
    measurement->timer_per_window_scaled_1e6 =
        ((uint64_t)elapsed_cycles * 1000000ULL) / (uint64_t)measurement->clock_hz;
  }

  return true;
}

static bool run_cadenced_window(ai_handle network,
                                ai_buffer *input,
                                ai_buffer *output,
                                TcnDutMeasurement *measurement)
{
  uint64_t phase_start_us = 0ULL;
  uint64_t next_release_us = 0ULL;
  uint64_t phase_end_us = 0ULL;
  uint64_t active_cycles_total = 0ULL;
  const uint64_t cadence_us = (uint64_t)TCN_DUT_LATENCY_BUDGET_MS * 1000ULL;

  fill_input_buffer(input);
  arm_harness_window();
  phase_start_us = rtc_now_us();
  next_release_us = phase_start_us;

  for (int run_idx = 0; run_idx < TCN_DUT_MEASURED_RUNS; ++run_idx)
  {
    uint64_t now_us = rtc_now_us();
    int64_t wake_recovery_us = 0;
    printf("STM32_CADENCE_SLOT=%d stage=begin now_us=%lu next_release_us=%lu\r\n",
           run_idx + 1,
           (unsigned long)now_us,
           (unsigned long)next_release_us);
    flush_stdout();

    if (now_us < next_release_us)
    {
      uint64_t slack_us = next_release_us - now_us;
      if (slack_us > (uint64_t)(TCN_DUT_WAKE_MARGIN_US + TCN_DUT_MIN_SLEEP_US))
      {
        uint32_t requested_sleep_us = (uint32_t)(slack_us - (uint64_t)TCN_DUT_WAKE_MARGIN_US);
        printf("STM32_CADENCE_SLOT=%d stage=sleep_request requested_us=%lu\r\n",
               run_idx + 1,
               (unsigned long)requested_sleep_us);
        flush_stdout();
        if (stop_sleep_for_us(requested_sleep_us, &wake_recovery_us))
        {
          measurement->rtc_sleep_total_us += (uint64_t)requested_sleep_us;
          measurement->wake_recovery_total_us += wake_recovery_us;
        }
      }
      while ((now_us = rtc_now_us()) < next_release_us)
      {
      }
    }

    uint64_t inference_start_us = rtc_now_us();
    printf("STM32_CADENCE_SLOT=%d stage=infer_start us=%lu\r\n",
           run_idx + 1,
           (unsigned long)inference_start_us);
    flush_stdout();
    uint32_t invoke_start_cycles = DWT->CYCCNT;
    measurement->wake_overshoot_total_us += (int64_t)(inference_start_us - next_release_us);
    ai_i32 batch = ai_network_run(network, input, output);
    uint32_t invoke_end_cycles = DWT->CYCCNT;
    if (batch != 1)
    {
      disarm_harness_window();
      printf("STM32_AI_RUN=FAIL batch=%ld run=%d\r\n", (long)batch, run_idx + 1);
      flush_stdout();
      return false;
    }

    active_cycles_total += (uint64_t)(invoke_end_cycles - invoke_start_cycles);
    printf("STM32_CADENCE_SLOT=%d stage=infer_done cycles=%lu\r\n",
           run_idx + 1,
           (unsigned long)(invoke_end_cycles - invoke_start_cycles));
    flush_stdout();
    measurement->runs_completed++;
    next_release_us += cadence_us;
    if (rtc_now_us() > next_release_us)
    {
      measurement->deadline_miss_count++;
    }
  }

