nesl/crest/sketches/stm32/tinyodom_tcn_stm32_lrun/Appli/Src/tcn_dut_runner.c
  while ((phase_end_us = rtc_now_us()) < next_release_us)
  {
  }
  disarm_harness_window();

  measurement->clock_hz = read_cpu_clock_hz();
  measurement->have_cycles = measurement->runs_completed > 0U;
  measurement->have_timing = measurement->runs_completed > 0U;
  if (measurement->runs_completed > 0U)
  {
    measurement->dwt_cycles_per_inference_milli =
        (active_cycles_total * 1000ULL) / (uint64_t)measurement->runs_completed;
    measurement->timer_per_inference_scaled_1e6 =
        (active_cycles_total * 1000000ULL) /
        ((uint64_t)measurement->clock_hz * (uint64_t)measurement->runs_completed);
    measurement->timer_per_window_scaled_1e6 = (phase_end_us - phase_start_us);
  }

  return true;
}

void tcn_dut_harness_gpio_init(void)
{
  GPIO_InitTypeDef gpio_init = {0};

  HAL_PWREx_EnableVddIO5();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();

  gpio_init.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init.Pull = GPIO_NOPULL;
  gpio_init.Speed = GPIO_SPEED_FREQ_LOW;

  gpio_init.Pin = TCN_DUT_ARM_GPIO_PIN;
  HAL_GPIO_Init(TCN_DUT_ARM_GPIO_PORT, &gpio_init);

  gpio_init.Pin = TCN_DUT_TRIGGER_GPIO_PIN;
  HAL_GPIO_Init(TCN_DUT_TRIGGER_GPIO_PORT, &gpio_init);

  set_harness_idle();
}

void tcn_dut_rtc_irq_handler(void)
{
  HAL_RTCEx_WakeUpTimerIRQHandler(&s_rtc_handle);
}

void HAL_RTCEx_WakeUpTimerEventCallback(RTC_HandleTypeDef *hrtc)
{
  if (hrtc->Instance == RTC)
  {
    s_rtc_wakeup_fired = true;
  }
}

int tcn_dut_run_once(void)
{
  ai_handle network = AI_HANDLE_NULL;
  TcnDutMeasurement measurement = {0};

  emit_line("STM32_BOOT=START");
  emit_line("STM32_RTC_INIT=START");
  if (!rtc_init())
  {
    emit_line("STM32_RTC_INIT=FAIL");
    emit_line("STM32_AI_INIT=FAIL reason=rtc_init");
    return -6;
  }
  emit_line("STM32_RTC_INIT=OK");
  if (!rtc_wakeup_irq_self_test())
  {
    if (TCN_DUT_SELECTED_PHASE == TCN_DUT_PHASE_CADENCED)
    {
      emit_line("STM32_AI_INIT=FAIL reason=rtc_wakeup_selftest");
      return -7;
    }
  }

  if (!ensure_external_weight_mapping_ready())
  {
    emit_line("STM32_AI_INIT=FAIL reason=external_weight_mapping");
    return -5;
  }

  const ai_handle activations[] = {s_network_activations};
  ai_error err = ai_network_create_and_init(&network, activations, NULL);
  if (err.type != AI_ERROR_NONE)
  {
    printf("STM32_AI_INIT=FAIL type=%d code=%d\r\n", err.type, err.code);
    flush_stdout();
    return -1;
  }

  printf("STM32_AI_INIT=OK\r\n");
  flush_stdout();
  emit_phase_header();

  ai_buffer *input = ai_network_inputs_get(network, NULL);
  ai_buffer *output = ai_network_outputs_get(network, NULL);

  fill_input_buffer(input);
  ai_i32 batch = ai_network_run(network, input, output);
  if (batch != 1)
  {
    printf("STM32_AI_RUN=FAIL batch=%ld\r\n", (long)batch);
    flush_stdout();
    ai_network_destroy(network);
    return -2;
  }

  if (!wait_for_start_command())
  {
    emit_line("STM32_AI_START=TIMEOUT");
    ai_network_destroy(network);
    return -3;
  }

  if (TCN_DUT_SELECTED_PHASE == TCN_DUT_PHASE_CADENCED)
  {
    if (!run_cadenced_window(network, input, output, &measurement))
    {
      ai_network_destroy(network);
      return -4;
    }
  }
  else
  {
    if (!run_back_to_back_window(network, input, output, &measurement))
    {
      ai_network_destroy(network);
      return -4;
    }
  }

  emit_measurement_telemetry(&measurement);
  ai_network_destroy(network);
  return 0;
}
